Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: · A suggested fix, or even a patch, if you have one.
pt_pt: · Uma correção sugerida, ou até mesmo um patch, caso você tenha preparado um.

source: · Details of the configuration of the program with the problem. Include the complete text of its configuration files.
pt_pt: · Detalhes da configuração do programa com problema. Inclua o texto completo dos arquivos de configuração do programa em questão.

source: · The versions of any packages on which the buggy package depends.
pt_pt: · As versões de quaisquer pacotes dos quais o pacote com problema dependa.

source: · What kernel version you're using (type uname -a), your shared C library (type ls -l /lib/*/libc.so.6 or apt show libc6 | grep ^Version), and any other details about your Debian system, if it seems appropriate. For example, if you had a problem with a Perl script, you would want to provide the version of the `perl' binary (type perl -v or dpkg -s perl | grep ^Version:).
pt_pt: · Qual versão de kernel você está usando (digite uname -a), sua biblioteca C compartilhada (digite ls -l /lib/*/libc.so.6 ou apt show libc6 | grep ^Version) e quaisquer outros detalhes sobre seu sistema Debian, caso pareçam apropriados. Por exemplo, se você tiver um problema com um script Perl, você pode informar a versão do binário "perl" (digite perl -v ou dpkg -s perl | grep ^Version:).

source: · Appropriate details of the hardware in your system. If you're reporting a problem with a device driver please list all the hardware in your system, as problems are often caused by IRQ and I/O address conflicts.
pt_pt: · Detalhes apropriados do hardware em seu sistema. Caso você esteja relatando um problema com um controlador de dispositivo (device driver), por favor liste todo hardware em seu sistema, uma vez que esses problemas são normalmente causados por conflitos de endereços de I/O e IRQ.

source: · If you have reportbug installed the output of reportbug --template -T none -s none -S normal -b --list-cc none -q <package> will also be useful, as it contains the output of maintainer specific scripts and version information.
pt_pt: · Se você tem o reportbug instalado, a saída de reportbug --template -T none -s none -S normal -b --list-cc none -q <pacote> também será útil, pois contém a saída dos scripts de mantenedor(a) específicos e informação de versão.

source: Include any detail that seems relevant — you are in very little danger of making your report too long by including too much information. If they are small, please include in your report any files you were using to reproduce the problem. (If they are large, consider making them available on a publicly available website if possible.)
pt_pt: Inclua qualquer detalhe que pareça relevante — você não perde nada por fazer um longo relatório, então adicione muita informação. Se forem relatórios pequenos, por favor inclua quaisquer arquivos que você esteja usando para reproduzir o problema. (Se eles forem grandes, considere torná-los disponíveis em algum site web publicamente acessível, se possível).

source: For more advice on how to help the developers solve your problem, please read How to Report Bugs Effectively.
pt_pt: Para maiores informações sobre como ajudar os(as) desenvolvedores(as) a solucionar seu problema, por favor, leia o documento como relatar bugs de maneira eficiente (em inglês).

source: An Example Bug Report
pt_pt: Um exemplo de relatório de bug

source: A bug report with header and pseudo-header looks something like this:
pt_pt: Um relatório de bug, com o cabeçalho e o pseudocabeçalho, se assemelha a este:

source: Subject: Hello says `goodbye'
pt_pt: Subject: Hello diz "goodbye"

source: When I invoke `hello' without arguments from an ordinary shell
pt_pt: Quando eu invoco "hello" sem argumentos a partir de um shell comum

source: prompt it prints `goodbye', rather than the expected `hello, world'.
pt_pt: o mesmo imprime "goodbye" ao invés do esperado "hello, world".

source: Here is a transcript:
pt_pt: Aqui está uma transcrição:

source: I suggest that the output string, in hello.c, be corrected.
pt_pt: Eu sugiro que a string de saída, em hello.c, seja corrigida.

source: I am using Debian GNU/Linux 2.2, kernel 2.2.17-pre-patch-13
pt_pt: Estou usando GNU/Linux Debian 2.2, kernel 2.2.17-pre-patch-13

source: and libc6 2.1.3-10.
pt_pt: e libc6 2.1.3-10.

source: Sending copies of bug reports to other addresses
pt_pt: Enviando cópias de relatórios de bugs para outros endereços

source: Sometimes it is necessary to send a copy of a bug report to somewhere else besides debian-bugs-dist and the package maintainer, which is where they are normally sent.
pt_pt: Algumas vezes é necessário enviar uma cópia do relatório de bug para algum outro endereço além de debian-bugs-dist e do(a) mantenedor(a) do pacote, que são os endereços para os quais normalmente se envia.

source: You could do this by CC'ing your bug report to the other address(es), but then the other copies would not have the bug report number put in the Reply-To field and the Subject line. When the recipients reply they will probably preserve the submit@bugs.debian.org entry in the header and have their message filed as a new bug report. This leads to many duplicated reports.
pt_pt: Você poderia fazer isso enviando uma cópia de seu relatório de bug (usando o campo CC) para o(s) outro(s) endereço(s). Mas desse modo as outras cópias não teriam o número do relatório de bug no campo Reply-To e na linha Assunto. Quando os destinatários responderem, eles provavelmente preservarão a entrada submit@bugs.debian.org no cabeçalho e terão suas mensagens enviadas como um novo relatório de bug. Isto leva a muitos relatórios duplicados.

source: The right way to do this is to use the X-Debbugs-CC pseudo-header. Add a line like this to your message's pseudo-headers:
pt_pt: A maneira correta de se fazer isso é usar o cabeçalho X-Debbugs-CC. Adicione uma linha como essa aos pseudocabeçalhos de sua mensagem:

source: X-Debbugs-CC: other-list@cosmic.edu
pt_pt: X-Debbugs-CC: outra-lista@cosmic.edu

source: This will cause the bug tracking system to send a copy of your report to the address(es) in the X-Debbugs-CC line as well as to debian-bugs-dist.
pt_pt: Isto fará com que o sistema de acompanhamento de bugs envie uma cópia de seu relatório para o(s) endereço(s) na linha X-Debbugs-CC e também para debian-bugs-dist.

source: If you want to send copies to more than one address, add them comma-separated in only one X-Debbugs-CC line.
pt_pt: Se quiser enviar cópias para mais de um endereço, adicione-os numa única linha X-Debbugs-CC, com o cuidado de separá-los por vírgulas.

source: Avoid sending such copies to the addresses of other bug reports, as they will be caught by the checks that prevent mail loops. There is relatively little point in using X-Debbugs-CC for this anyway, as the bug number added by that mechanism will just be replaced by a new one; use an ordinary CC header instead.
pt_pt: Evite enviar estas cópias para o endereço de outros relatórios de bugs, já que elas serão pegas pela checagem que evita loops de mensagens. De qualquer forma, não há um bom motivo em usar X-Debbugs-CC para isto, já que o número do bug adicionado por este mecanismo será substituído por um outro; em vez disso, use o campo CC.

source: This feature can often be combined usefully with mailing quiet — see below.
pt_pt: Este recurso pode geralmente ser combinado de maneira útil com quiet — veja abaixo.

source: Additional Pseudoheaders
pt_pt: Pseudocabeçalhos adicionais

source: Severity levels
pt_pt: Níveis de severidade

source: If a report is of a particularly serious bug, or is merely a feature request, you can set the severity level of the bug as you report it. This is not required however, and the package maintainer will assign an appropriate severity level to your report even if you do not (or pick the wrong severity).
pt_pt: Se um relatório é de um bug particularmente sério (serious), ou é meramente uma requisição de novo recurso (wishlist), você pode definir o nível de severidade no momento em que o relata. Isto, no entanto, não é exigido e os(as) mantenedores(as) do pacote atribuirão um nível de severidade apropriado para seu relatório caso você não o faça (ou escolha a severidade errada).

source: To assign a severity level, put a line like this one in the pseudo-header:
pt_pt: Para atribuir um nível de severidade, coloque uma linha como essa no pseudocabeçalho:

source: Severity: <severity>
pt_pt: Severity: <severidade>

source: Replace <severity> with one of the available severity levels, as described in the advanced documentation.
pt_pt: Substitua <severidade> por um dos níveis de severidade disponíveis, como descrito na documentação avançada.

source: Assigning tags
pt_pt: Atribuindo tags

source: You can set tags on a bug as you are reporting it. For example, if you are including a patch with your bug report, you may wish to set the patch tag. This is not required, however, and the developers will set tags on your report as and when it is appropriate.
pt_pt: Você pode definir tags em um bug quando envia o relatório. Por exemplo, caso você esteja incluindo um patch junto ao seu relatório de bug, você pode definir a tag patch. Porém, isso não é exigido, e os(as) desenvolvedores(as) definirão tags em seu relatório quando apropriado.

source: To set tags, put a line like this one in the pseudo-header:
pt_pt: Para definir tags, inclua uma linha como essa no pseudocabeçalho:

source: Tags: <tags>
pt_pt: Tags: <etiquetas>

source: Replace <tags> with one or more of the available tags, as described in the advanced documentation. Separate multiple tags with commas, spaces, or both.
pt_pt: Substitua <etiquetas> por uma ou mais tags disponíveis, conforme descrito na documentação avançada. Separe múltiplas tags por vírgulas, espaços ou ambos.

source: User: <username>
pt_pt: User: <nome-de-usuário(a)>

source: Usertags: <usertags>
pt_pt: Usertags: <tags-de-usuário(a)>

source: Replace <usertags> with one or more usertags. Separate multiple tags with commas, spaces, or both. If you specify a <username>, that user's tags will be set. Otherwise, the e-mail address of the sender will be used as the username.
pt_pt: Substitua <tags-de-usuário(a)> com uma ou mais tags de usuário(a). Separe várias tags com vírgulas, espaços ou ambos. Se você especificar um <nome-de-usuário(a)>, as tags deste(a) usuário(a) serão definidas. Caso contrário, o endereço de e-mail do remetente será usado como nome de usuário(a).

source: You can set usertags for multiple users at bug submission time by including multiple User pseudo-headers; each Usertags pseudo-header sets the usertags for the preceding User pseudo-header. This is especially useful for setting usertags for a team with multiple users, setting usertags for multiple teams, or setting the architecture usertags for bugs affecting multiple architectures.
pt_pt: Você pode definir tags-de-usuário(a) para vários(as) usuários(as) no momento do envio do bug, incluindo vários pseudocabeçalhos de usuário(a); cada tag-de-usuário(a) pseudocabeçalho define as tags-de-usuário(a) para o pseudocabeçalho do(a) usuário(a) anterior. Isto é especialmente útil para definir tags-de-usuário(a) para uma equipe com vários(as) usuários(as), definir tags-de-usuário(a) para várias equipes ou definir as https://wiki.debian.org/Teams/Debbugs/ArchitectureTags|tags-de-usuário(a) architecture para bugs que afetam várias arquiteturas .

source: User: <first-username>
pt_pt: User: <primeiro-nome-do(a)-usuário(a)>

source: Usertags: <first-username usertags>
pt_pt: Usertags: <tags-de-usuário(a) primeiro-nome-do(a)-usuário(a)>

source: User: <second-username>
pt_pt: User: <segundo-nome-do(a)-usuário(a)>

source: Usertags: <second-username usertags>
pt_pt: Usertags: <tags-de-usuário(a) segundo-nome-do(a)-usuário(a)>

source: Setting Forwarded
pt_pt: Definir encaminhamento

source: will mark the newly submitted bug as forwarded to foo@example.com. See Recording that you have passed on a bug report in the developers' documentation for details.
pt_pt: marcará o novo relatório de bug submetido como encaminhado para foo@example.com. Veja, para detalhes, registrando que você encaminhou um relatório de bug na documentação dos(as) desenvolvedores(as).

source: Claiming ownership
pt_pt: Reivindicar responsabilidade

source: will indicate that foo@example.com is now responsible for fixing this bug. See Changing bug ownership in the developers' documentation for details.
pt_pt: indicará que foo@example.com é agora o(a) responsável por resolver este bug. Veja alterando o responsável pelo bug na documentação dos(as) desenvolvedores(as) para detalhes.

source: Source Package
pt_pt: Pacote de código fonte

source: Source: foopackage
pt_pt: Source: foopacote

source: the equivalent of Package: for bugs present in the source package of foopackage; for most bugs in most packages you don't want to use this option.
pt_pt: o equivalente a Package: para bugs presentes no pacote do código fonte de foopacote; para a maioria dos bugs na maioria dos pacotes você não precisa usar esta opção.

source: Control Commands
pt_pt: Comandos de Controle

source: Control: control commands
pt_pt: Control: comandos de controle

source: Allows for any of the commands which must be sent to control@bugs.debian.org to work when sent to submit@bugs.debian.org or nnn@bugs.debian.org. -1 initially refers to the current bug (that is, the bug created by a mail to submit@ or the bug messaged with nnn@). Please see the server control documentation for more information on the control commands which are valid.
pt_pt: Permite que quaisquer comandos que devem ser enviados para control@bugs.debian.org funcionem quando enviados para submit@bugs.debian.org ou nnn@bugs.debian.org. -1 refere-se inicialmente ao bug atual (ou seja, o bug criado por um e-mail para submit@ ou o bug comunicado com nnn@). Por favor, veja a documentação de servidor de controle para mais informações sobre os comandos de controle válidos.

source: For example, the following pseudoheader in a message sent to 12345@bugs.debian.org:
pt_pt: Por exemplo, o pseudocabeçalho na mensagem enviada para 12345@bugs.debian.org:

source: Control: retitle -1 this is the title
pt_pt: Control: retitle -1 este é um título

source: would cause 12345 to be retitled, its severity changed, summary set, and marked as forwarded.
pt_pt: faz com que o bug 12345 receba um novo título (em inglês), mude sua severidade, defina um sumário e marque o bug como encaminhado.

source: X-Debbugs- headers
pt_pt: Cabeçalhos X-Debbugs-

source: Finally, if your MUA doesn't allow you to edit the headers, you can set the various X-Debbugs- headers in the pseudo-headers.
pt_pt: Finalmente, se seu MUA não permite que você edite os cabeçalhos das mensagens, você pode definir os diversos cabeçalhos X-Debbugs- nos pseudocabeçalhos.

source: Additional information
pt_pt: Informação adicional

source: Different submission addresses (minor or mass bug reports)
pt_pt: Endereços de envio diferentes (relatórios de bugs menores ou em massa)

source: If a bug report is minor, for example, a documentation typo or a trivial build problem, please adjust the severity appropriately and send it to maintonly@bugs.debian.org instead of submit@bugs.debian.org. maintonly will forward the report to the package maintainer only, it won't forward it to the BTS mailing lists.
pt_pt: Caso um relatório seja de um bug menor, por exemplo um erro ortográfico na documentação ou um problema de compilação trivial, por favor ajuste a severidade apropriadamente e envie o mesmo para maintonly@bugs.debian.org em vez de submit@bugs.debian.org. maintonly encaminhará o relatório somente para o(a) mantenedor(a) do pacote e não para as listas de discussão do BTS.

source: If you're submitting many reports at once, you should definitely use maintonly@bugs.debian.org so that you don't cause too much redundant traffic on the BTS mailing lists. Before submitting many similar bugs you may also want to post a summary on debian-bugs-dist.
pt_pt: Caso você esteja enviando muitos relatórios de uma vez, você definitivamente deverá usar maintonly@bugs.debian.org de modo que não cause muito tráfego redundante nas listas de discussão do BTS. Antes de enviar muitos bugs similares, você também pode publicar um sumário em debian-bugs-dist.

source: If you wish to report a bug to the bug tracking system that's already been sent to the maintainer, you can use quiet@bugs.debian.org. Bugs sent to quiet@bugs.debian.org will not be forwarded anywhere, only filed.
pt_pt: Caso deseje relatar um bug para o sistema de acompanhamento de bugs que já tenha sido enviado para o(a) mantenedor(a), você pode usar quiet@bugs.debian.org. Bugs enviados para quiet@bugs.debian.org não serão encaminhados para lugar algum, somente serão registrados.

source: When you use different submission addresses, the bug tracking system will set the Reply-To of any forwarded message so that the replies will by default be processed in the same way as the original report. That means that, for example, replies to maintonly will go to nnn-maintonly@bugs.debian.org instead of nnn@bugs.debian.org, unless of course one overrides this manually.
pt_pt: Quando você utiliza endereços de envio diferentes, o sistema de acompanhamento de bugs irá definir o Reply-To de quaisquer mensagens encaminhadas para que as respostas sejam por padrão processadas da mesma maneira que o relatório original. Isto significa que, por exemplo, respostas para maintonly irão para nnn-maintonly@bugs.debian.org em vez de nnn@bugs.debian.org, a menos, é claro, que alguém sobrescreva isso manualmente.

source: Acknowledgements
pt_pt: Confirmações

source: Normally, the bug tracking system will return an acknowledgement to you by e-mail when you report a new bug or submit additional information to an existing bug. If you want to suppress this acknowledgement, include an X-Debbugs-No-Ack header or pseudoheader in your e-mail (the contents of this header do not matter). If you report a new bug with this header, you will need to check the web interface yourself to find the bug number.
pt_pt: Normalmente, o sistema de acompanhamento de bugs lhe retornará uma confirmação por e-mail, após você relatar um novo bug ou enviar uma informação adicional para um bug existente. Se você quiser suprimir esta confirmação, inclua um cabeçalho ou pseudocabeçalho X-Debbugs-No-Ack no seu e-mail (o conteúdo deste cabeçalho não importa). Se você relatar um novo bug com este cabeçalho, você precisará checar a interface web para descobrir o número do bug.

source: Note that this header will not suppress acknowledgements from the control@bugs.debian.org mailserver, since those acknowledgements may contain error messages which should be read and acted upon.
pt_pt: Note que este cabeçalho não irá suprimir confirmações do servidor de e-mails control@bugs.debian.org, já que estas confirmações podem conter mensagens de erro que devem ser lidas e trabalhadas imediatamente.

source: Spamfighting and missing mail
pt_pt: Bloqueio de spam e e-mails perdidos

source: The bug tracking system implements a rather extensive set of rules designed to make sure that spam does not make it through the BTS. While we try to minimize the number of false positives, they do occur. If you suspect your mail has triggered a false positive, feel free to contact owner@bugs.debian.org for assistance. Another common cause of mail not making it through to the BTS is utilizing addresses which match procmail's FROM_DAEMON, which includes mail from addresses like mail@foobar.com. If you suspect your mail matches FROM_DAEMON, see procmailrc(5) to verify, and then resend the mail using an address which does not match FROM_DAEMON.
pt_pt: O sistema de acompanhamento de bugs implementa um conjunto particularmente abrangente de regras para se certificar de que não seja inserido spam no BTS. Mesmo que tentemos minimizar o número de falsos positivos, eles ocorrem. Se você suspeitar de que seu e-mail causou um falso positivo, fique à vontade para entrar em contato com owner@bugs.debian.org e pedir ajuda. Outra causa comum pela qual um e-mail não chega ao BTS é a utilização de endereços que coincidem com FROM_DAEMON do procmail, o que inclui endereços como mail@foobar.com. Se você suspeitar que seu e-mail coincide com FROM_DAEMON, veja procmailrc(5) para verificar, e então re-envie seu e-mail usando um endereço que não coincida com FROM_DAEMON.

source: Bug reports against unknown packages
pt_pt: Relatórios de bugs para pacotes desconhecidos

source: If the bug tracking system doesn't know who the maintainer of the relevant package is it will forward the report to debian-bugs-dist even if maintonly was used.
pt_pt: Caso o sistema de acompanhamento de bugs não saiba quem é o(a) mantenedor(a) do pacote em questão, o mesmo encaminhará o relatório para debian-bugs-dist mesmo se maintonly for usado.

source: When sending to maintonly@bugs.debian.org or nnn-maintonly@bugs.debian.org you should make sure that the bug report is assigned to the right package, by putting a correct Package at the top of an original submission of a report, or by using the control@bugs.debian.org service to (re)assign the report appropriately.
pt_pt: Ao enviar para maintonly@bugs.debian.org ou nnn-maintonly@bugs.debian.org, você deve certificar-se de atribuir o relatório de bug ao pacote correto, colocando um Package correto no topo de um envio original de um relatório, ou usando o serviço control@bugs.debian.org para (re)atribuir o relatório apropriadamente.

source: Using dpkg to find the package and version for the report
pt_pt: Usando o dpkg para encontrar o pacote e a versão para o relatório

source: When using reportbug to report a bug in a command, say grep, the following will automatically select the right package and let you write the report right away: reportbug --file $(which grep)
pt_pt: Quando estiver usando o reportbug para relatar um bug de um comando, digamos o grep, a instrução a seguir selecionará automaticamente o pacote correto e permitirá que imediatamente você escreva o relatório: reportbug --file $(which grep)

source: You can also find out which package installed it by using dpkg --search. You can find out which version of a package you have installed by using dpkg --list or dpkg --status.
pt_pt: Você também pode encontrar qual pacote instalou o comando através de dpkg --search. Você pode encontrar qual versão instalada de um pacote você possui usando dpkg --list ou dpkg --status.

source: For example:
pt_pt: Por exemplo:

source: Other useful commands and packages
pt_pt: Outros comandos e pacotes úteis

source: The querybts tool, available from the same package as reportbug, provides a convenient text-based interface to the bug tracking system.
pt_pt: A ferramenta querybts, disponível a partir do mesmo pacote que o reportbug, fornece uma interface conveniente em modo texto para o sistema de acompanhamento de bugs.

source: Emacs users can also use the debian-bug command provided by the debian-el package. When called with M-x debian-bug, it will ask for all necessary information in a similar way to reportbug.
pt_pt: Usuários Emacs também podem usar o comando debian-bug fornecido pelo pacote debian-el. Quando chamado com M-x debian-bug, ele perguntará por todas as informações necessárias de forma similar ao reportbug.

source: · Bug tracking system main contents page.
pt_pt: · Página principal dos conteúdos do sistema de gerenciamento de bugs.

source: · Instructions for reporting bugs.
pt_pt: · Instruções para reportar bugs.

source: · Accessing the bug tracking system logs.
pt_pt: · Acessando os logs do sistema de gerenciamento de bugs.
